db_2_20_0 = {
    0xfe01: ('Временная метка {} сек', 'I', 'TIME_UTC', 'TIME', 'set_timestamp'),
}
db_2_20_0_analyzed = {
    # 0x0372: ('{:18} : {:3}: {:3}: {:3}: {:3}: {:3}', 'PIIIII', '?', '?'),

    0x0d14: ('{:3} : {:22} : {:3} : {}', 'IPIP', '?', '?'),

    # 0x0e21: ('{} {}', 'PP', '?', '?'),
    # 0x0e2a: ('{}', 'P', '?', '?'),

    0x0d1e: ('Временная метка (2?) {} сек', 'I', '? TIME_UTC', '? TIME', 'is_timestamp'),

    # 0x0f06: ('{} : {} : {} : {} : {} : {} : {} : {} : {}', 'I9', '?', '?'),
    0x0f40: ('{} : {} : {} : {} : {} : {}', 'I6', '?', '? freq'),
}

########################################################################################################################

db_2_24_2 = {
    0x0262: ('Заряд батарейки метки {}: {}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}', 'II15', '?', '? метка'),
    0x09fd: ('SIM не обнаружена', '', '', ''),
    0xfe01: ('Временная метка {} сек', 'I', 'TIME_UTC', 'TIME', 'set_timestamp'),
}

########################################################################################################################

db_2_26_1 = {
    0x038e: ('RPM = {}', 'I', '? LOG_INFO', '? ENG'),

    # возможно 0x0d61
    # это стутус 'Команда на запуск с брелка'

    # чтото из 0x0405, 0x03ba, 0x0e27, 0x0bf9, 0x0098
    # это статус: 'Двигатель остановился. Выключаем поддержку зажигания'

    0xfe01: ('Временная метка {} сек', 'I', 'TIME_UTC', 'TIME', 'set_timestamp'),
}

########################################################################################################################

db_2_28_2 = {
    0xfe01: ('Временная метка {} сек', 'I', 'TIME_UTC', 'TIME', 'set_timestamp'),
}
db_2_28_2_analyzed = {
    0x0005: ('{:4} : {:4}, {:4}, {:4}, {:4}, {:4} : {:4}, {:4}, {:4}, {:4}, {:4} : {:4}, {:4}, {:4}, {:4}, {:4}', 'Ii15', '?', '? gyro'),

    0x0070: ('Сработал датчик удара по нижне...???', '', 'LOG_DEBUG', 'TASK_SENSOR'),
    0x0086: ('Сработал датчик удара по верхн...???', '', 'LOG_DEBUG', 'TASK_SENSOR'),
    0x0087: ('Срабатывание датчика удара по ...???', '', 'LOG_DEBUG', 'TASK_SENSOR'),
    0x0088: ('Срабатывание датчика удара по ...???', '', 'LOG_DEBUG', 'TASK_SENSOR'),
    0x0089: ('Сработал датчик наклона', '', 'LOG_DEBUG', 'TASK_SENSOR'),
    0x008a: ('Срабатывание датчика наклона с...???', '', 'LOG_DEBUG', 'TASK_SENSOR'),

    0x0117: ('Режим SLP: 0x{:02x}', 'I', 'LOG_DEBUG', 'BLE_FSM_XCHG'),

    0x02ae: ('{}', 'P', '', ''),
    # 5й int уже мусор
    0x02da: ('{:5} : {:5} : {:5} : {:5}', 'IIII', '?', '?'),

    0x030d: ('no filter voltage: {:5} : {:5} : {:5} : {:5} : {:5}', 'IIIII', '?', '? volt'),
    0x030e: ('filter 1  voltage: {:5} : {:5} : {:5} : {:5} : {:5}', 'IIIII', '?', '? volt'),
    0x030f: ('filter 2  voltage: {:5} : {:5} : {:5} : {:5} : {:5}', 'IIIII', '?', '? volt'),
    0x033b: ('{} : {} : {} : {} : {}', 'PPPPP', '?', '? temp салон'),
    0x033e: ('{} : {} : {} : {} : {}', 'PPPPP', '?', '? temp двигатель'),
    0x0376: ('{}: {}', 'PP', 'LOG_BLOCK', 'VERSION'),
    0x03c1: ('Двигатель заведен. RPM = {}', 'I', '? LOG_INFO', '? ENG'),

    0x0ba1: ('{}: {}: {} раз \'1\'={}ms \'0\'={}ms (vol={}%)', 'PPIiiI', 'LOG_DEBUG', 'OUTS'),

    0x0c72: ('{:3} : {:18} : {:3}', 'IPI', '?', '?'),
    0x0c7d: ('Временная метка (2?) {} сек', 'I', '? TIME_UTC', '? TIME', 'is_timestamp'),
    0x0c9c: ('Счетчик: {}: мелодия: {}: данные {:02x} {:02x} {:02x} {:02x} {:02x} {:02x} {:02x} {:02x} {:02x} {:02x} {:02x}', 'III11', 'LOG_INFO', 'REM_DLG'),
    0x0c9d: ('{}: {}', 'PP', 'LOG_INFO', 'REM_DLG'),
    # не точно
    # 0x0ce7: ('Диалог закончен. Есть запрос на отправку статуса', '', 'LOG_DEBUG', 'REM_IRX_SPI'),

    0x0d21: ('___pFunc___:____cnt____:_max_:_?_:_?_:_???_', '', 'LOG_BLOCK', 'ROUTER'),
    0x0d22: ('0x{:08x} : {:9} : {:3} : {} : {} : {}', 'IIIIIP', 'LOG_BLOCK', 'ROUTER'),
    0x0d2c: ('ZONE: {} = {}', 'PP', 'LOG_DEBUG', 'SYSDATA'),
    0x0d34: ('MASK:{} по {} = {}', 'IPI', 'LOG_DEBUG', 'SYSDATA'),
    0x0d3a: ('MASK:{} по {} = {}', 'IPI', 'LOG_DEBUG', 'SYSDATA'),
    0x0d41: ('FLAG: {} = {}', 'PP', 'LOG_DEBUG', 'SYSDATA'),
    0x0d53: ('{:3}: {:3}: {:3}: {:5}: {:2}.{:02} : {}', 'IIIIIIP', 'LOG_BLOCK', 'TNPROFILER'),
    0x0d5c: ('_ID:Стек:Не исп.:Макс.:Загруз. ...???', '', 'LOG_BLOCK', 'TNPROFILER'),
    0x0d61: ('device: {}', 'P', '? LOG_BLOCK', '?'),
    0x0d6d: ('fw_ver_hash: {}', 'P', '? LOG_BLOCK', 'TNPROFILER'),
    0x0d6e: ('модель платы?: {}', 'P', '? LOG_BLOCK', 'TNPROFILER'),
    0x0d70: ('Сборка: {}', 'P', 'LOG_BLOCK', 'TNPROFILER'),
    0x0d71: ('Git hash прошивки {}', 'P', 'LOG_BLOCK', 'TNPROFILER'),
    0x0da5: ('date...: {} : {} : {} : {}', 'PIPI', '? LOG_BLOCK', '?'),
    0x0dbf: ('{} {} {} {}', 'IPII', '?', '?'),
    0x0dcc: ('{} {} {}', 'IPI', '?', '?'),
    0x0de2: ('Датчик наклона: конец сработки', '', 'LOG_INFO', 'USER_EVENT'),
    0x0de3: ('Датчик удара LOW: конец сработки', '', 'LOG_INFO', 'USER_EVENT'),
    0x0de4: ('Датчик удара HIGH: конец сработки', '', 'LOG_INFO', 'USER_EVENT'),

    0x0eb0: ('{:5} : {:5} : {:5} : {:5} : {:5} : {:5} : {:5} : {:5} : {:5}', 'I9', '?', '?'),
}

########################################################################################################################

db_2_30_0_known = {
    # То, что я точно знаю
    0x0098: ('Перерасчитана чувствит. ДУ для охранных режимов', '', 'LOG_DEBUG', 'TASK_SENSOR'),

    0x0117: ('Режим SLP: 0x{:02x}', 'I', 'LOG_DEBUG', 'BLE_FSM_XCHG'),

    0x0408: ('Имитация двери', '', 'LOG_INFO', 'ENG_CONTROL'),
    0x0409: ('STATE: {} -> {}', 'II', 'LOG_DEBUG', 'ENG_CONTROL'),
    0x040a: ('EXT_STATE: {} -> {}', 'II', 'LOG_DEBUG', 'ENG_CONTROL'),
    0x040b: ('EXT_REASON: {} -> {}', 'II', 'LOG_DEBUG', 'ENG_CONTROL'),
    0x040c: ('ID: {} -> {}', 'PP', 'LOG_DEBUG', 'ENG_CONTROL'),
    0x0434: ('Вых. на обходчик иммобилайзера выкл.', '', 'LOG_INFO', 'ENG_CONTROL_COMMON'),
    0x044b: ('Пропал статус зажиг.', '', 'LOG_DEBUG', 'ENG_CONTROL_KEY'),
    0x044c: ('Ошибка запуска: пропал статус зажиг.', '', 'LOG_ERR', 'ENG_CONTROL_KEY'),
    0x0479: ('Педаль тормоза замаскирована. Не реагируем', '', 'LOG_DEBUG', 'ENG_MSG'),

    # (поддержка зажигания)
    0x09a2: ('Выключена ПЗ', '', 'LOG_INFO', 'GUARD_COMMON'),

    0x0ba9: ('{}: {}: {} раз \'1\'={}ms \'0\'={}ms (vol={}%)', 'PPIiiI', 'LOG_DEBUG', 'OUTS'),

    0x0ca1: (
        'Счетчик: {}: мелодия: {}: данные {:02x} {:02x} {:02x} {:02x} {:02x} {:02x} {:02x} {:02x} {:02x} {:02x} {:02x}',
        'III11', 'LOG_INFO', 'REM_DLG'),
    0x0ca2: ('{}: {}', 'PP', 'LOG_INFO', 'REM_DLG'),
    0x0cec: ('Диалог закончен. Есть запрос на отправку статуса', '', 'LOG_DEBUG', 'REM_IRX_SPI'),

    0x0d09: ('ШВР {} по причине {}', 'II', 'LOG_INFO', 'REM_UI'),
    0x0d31: ('ZONE: {} = {}', 'PP', 'LOG_DEBUG', 'SYSDATA'),
    0x0d35: ('ENG_STATE:{}:{}:{}:flags=0x{:02x}:guard=0x{:02x}:src={}', 'PPPIIP', 'LOG_DEBUG', 'SYSDATA'),
    0x0d3f: ('MASK:{} по {} = {}', 'IPI', 'LOG_DEBUG', 'SYSDATA'),
    0x0d46: ('FLAG: {} = {}', 'PP', 'LOG_DEBUG', 'SYSDATA'),
    0x0dcf: ('UI_NOTIFY: idx_tab={} src={:x} cmd={} ev={}', 'IIII', 'LOG_DEBUG', 'UI_TABLE'),
    0x0dd0: ('Рез-т cmd={}: {}', 'II', 'LOG_DEBUG', 'UI_TABLE'),
    0x0dd2: ('Удал. слушателя: idx_tab={} src={:x} cmd={} ev={}', 'IIII', 'LOG_DEBUG', 'UI_TABLE'),

    0x0e01: ('Двигатель: заглушен', '', 'LOG_INFO', 'USER_EVENT'),

    0xfe01: ('Временная метка {} сек', 'I', 'TIME_UTC', 'TIME', 'set_timestamp'),
}
db_2_30_0_analyzed_e96v2 = {
    0x0005: ('{:4} : {:4}, {:4}, {:4}, {:4}, {:4} : {:4}, {:4}, {:4}, {:4}, {:4} : {:4}, {:4}, {:4}, {:4}, {:4}', 'Ii15', '?', '? gyro'),
    0x0006: ('{} : {}', 'PI', '?', '?'),
    # вероятно заголовок таблицы
    0x006e: ('_#_ : _?_ : _?_ : _?_ : _?_ : _?_ : _?_', '', '?', '?'),
    0x006f: ('{:3} : {:3} : {:3} : {:3} : {:3} : {:3} : {:3}', 'I7', '?', '?'),

    # вначале идёт 0x0070 и в туже ms 0x0d31 'ZONE: SHOCK LOW = active'
    0x0070: ('Сработал датчик удара по нижне...???', '', 'LOG_DEBUG', 'TASK_SENSOR'),
    # вначале идёт 0x0086 и через 1-3ms 0x0d31 'ZONE: SHOCK HIGH = active'
    0x0086: ('Сработал датчик удара по верхн...???', '', 'LOG_DEBUG', 'TASK_SENSOR'),
    # в одну ms идут 0x0087 (или может быть 0x0086?) и 0x0de5 и через 2-3ms 0x0d31 'ZONE: SHOCK LOW = passive'
    # 0x0086 тоже часто встречается, но это вроде от 'SHOCK HIGH = active'
    0x0087: ('Срабатывание датчика удара по ...???', '', 'LOG_DEBUG', 'TASK_SENSOR'),
    # в течении <1ms идут 0x0088, 0x0de6 и через 2-3ms 0x0d31 'ZONE: SHOCK HIGH = passive'
    0x0088: ('Срабатывание датчика удара по ...???', '', 'LOG_DEBUG', 'TASK_SENSOR'),
    # вначале идёт 0x0089 и через 1-3ms 0x0d31 'ZONE: ДАТЧИК НАКЛОНА = active'
    0x0089: ('Сработал датчик наклона', '', 'LOG_DEBUG', 'TASK_SENSOR'),
    # в течении <1ms идут 0x008a, 0x0de4 и через 2ms 0x0d31 'ZONE: ДАТЧИК НАКЛОНА = passive'
    0x008a: ('Срабатывание датчика наклона с...???', '', 'LOG_DEBUG', 'TASK_SENSOR'),
    # в течении 0-2ms идут 0x008a, 0x033e и через 1ms 0x0d31 'ZONE: ДАТЧИК ДВИЖЕНИЯ = active'
    0x008b: ('Сработал датчик движения', '', 'LOG_DEBUG', 'TASK_SENSOR'),
    # в течении <1ms идут 0x008d, 0x0de3 и через 2-3ms 0x0d31 'ZONE: ДАТЧИК ДВИЖЕНИЯ = passive'
    0x008d: ('Срабатывание датчика движения', '', 'LOG_DEBUG', 'TASK_SENSOR'),
    0x00a8: ('{}', 'P', '?', '?'),
    0x00e7: ('{}', 'P', '?', '?'),
    0x00ea: ('{}', 'P', '?', '?'),
    0x00ed: ('{}: {}', 'PI', '?', '?'),

    0x0107: ('{:3} : {:3} : {:3} : {:3} : {:3}', 'I5', '?', '?'),
    0x0108: ('{} : {} : {}', 'PPI', '?', '?'),
    # какойто загрузчик?
    0x0132: ('{}: {}', 'PP', 'LOG_BLOCK', 'VERSION'),
    0x013c: ('{}', 'P', '?', '?'),
    0x013e: ('{}', 'P', '?', '?VERSION'),
    0x013f: ('{}', 'P', '?', '?VERSION'),
    0x0140: ('{}', 'P', '?', '?VERSION'),
    0x0141: ('{}', 'P', '?', '?VERSION'),
    0x01d4: ('{}', 'P', '?', '?'),
    0x01f9: ('{}', 'I', '?', '?'),
    # точно > 8
    0x01fa: ('{:5} : {:5} : {:5} : {:5} : {:5} : {:5} : {:5} : {:5}', 'I8', '?', '?'),
    0x01ff: ('{}: {} : {} : {}', 'IPPI', '?', '?'),

    0x021e: ('{} : {}', 'II', '?', '?'),
    0x024b: ('{} : {} : {} : {} : {}', 'I5', '?', '?'),
    0x0268: ('{} : {}', 'II', '?', '?'),
    0x0269: ('{} : {}', 'II', '?', '?'),
    0x026e: ('{} = {}', 'II', '?', '?'),
    0x026f: ('{}', 'I', '?', '?'),  # чтото ствязано с состоянием БАГАЖНИК
    0x0271: ('{}', 'I', '?', '?'),
    0x0273: ('{}', 'I', '?', '?'),
    0x0275: ('{}', 'I', '?', '?'),
    0x0279: ('{}', 'I', '?', '?'),
    0x027f: ('{}', 'I', '?', '?'),
    0x0280: ('{}', 'I', '?', '?'),
    0x0288: ('{}', 'I', '?', '?'),
    0x028a: ('{}', 'I', '?', '?'),
    0x02a9: ('{} : {}', 'II', '?', '?'),
    0x02aa: ('{} : {}', 'II', '?', '?'),
    0x02b6: ('{}', 'P', '?', '?'),
    # 5й int уже мусор
    0x02e3: ('{:5} : {:5} : {:5} : {:5}', 'IIII', '?', '?'),

    0x031d: ('no filter voltage: {:5} : {:5} : {:5} : {:5} : {:5}', 'IIIII', '?', '? volt'),
    0x031e: ('filter 1  voltage: {:5} : {:5} : {:5} : {:5} : {:5}', 'IIIII', '?', '? volt'),
    0x031f: ('filter 2  voltage: {:5} : {:5} : {:5} : {:5} : {:5}', 'IIIII', '?', '? volt'),
    0x033e: ('Активен паркинг игнорируем дат...???', '', 'LOG_INFO', 'GUARD_STATE_DISARM'),
    0x034d: ('{} : 0x{:08x} : 0x{:04x}', 'PII', '?', '? STACK'),
    # вероятно 8
    0x034e: ('{:08X}h,{:08X}h,{:08X}h,{:08X}h,{:08X}h,{:08X}h,{:08X}h,{:08X}h,{:08X}h,', 'I9', '?', '? STACK'),
    0x0350: ('{} : {} : {} : {} : {}', 'PPPPP', '?', '? temp салон'),
    0x0353: ('{} : {} : {} : {} : {}', 'PPPPP', '?', '? temp двигатель'),
    0x0359: ('{} : {}', 'II', '?', '?'),
    0x038a: ('{}: {}', 'PP', 'LOG_BLOCK', 'VERSION'),
    0x03d6: ('RPM (?) = {}', 'I', '? LOG_INFO', '? ENG'),
    0x03d8: ('{}', 'I', '?', '?'),
    0x03d9: ('{}', 'I', '?', '?'),
    0x03dc: ('Двигатель заведен. RPM = {}', 'I', '? LOG_INFO', '? ENG'),
    0x03f2: ('{}', 'I', '?', '?'),
    0x03f3: ('{}', 'I', '?', '?'),
    0x03fd: ('{}', 'P', '?', '?'),
    0x03ff: ('{}', 'P', '?', '?'),

    0x0483: ('status? (0x0483)', '', '?', '?'),

    0x0521: ('{} {} : {} {} : {} {} : {} {} : {} {}', 'IPIPIPIPIP', '?', '? литры'),

    0x096a: ('{}', 'P', '?', '?'),
    0x096e: ('{} -> {}', 'PP', 'LOG_INFO', 'GUARD'),
    0x0970: ('status? (0x0970)', '', '?', '?'),
    0x0979: ('{} : {}', 'IP', '?', '?'),
    # Время, через которое будет выполнена перепостановка на охрану
    0x0986: ('Перепостановка через {} сек', 'IP', '?', '?'),
    0x0998: ('{}', 'P', '?', '?'),
    0x0999: ('{}', 'P', '?', '?'),
    0x099b: ('{}', 'P', '?', '?'),
    0x09ae: ('hf_mask = ({})', 'P', '? LOG_DEBUG', '? GUARD_HANDS_FREE'),
    0x09af: ('hf_mask = ({})', 'P', '? LOG_DEBUG', '?GUARD_HANDS_FREE'),
    0x09b0: ('hf_mask = ({})', 'P', 'LOG_DEBUG', 'GUARD_HANDS_FREE'),
    0x09f5: ('{} : {}', 'PP', '?', '?'),

    # Авторизация:...
    0x0a4d: ('{}', 'P', '?', '?'),
    # Права авторизации:...
    0x0a4e: ('{}', 'P', '?', '?'),
    # Авторизация:...
    0x0a65: ('{}', 'P', '?', '?'),
    # Права авторизации:...
    0x0a66: ('{}', 'P', '?', '?'),
    # Авторизация:...
    0x0a9f: ('{}', 'P', 'LOG_INFO', 'GUARD_STATE_ARM'),
    # Права авторизации:...
    0x0aa0: ('{}', 'P', 'LOG_INFO', 'GUARD_STATE_ARM'),
    # Авторизация:...
    0x0acd: ('{}', 'P', '?', '?'),
    # Права авторизации:...
    0x0ace: ('{}', 'P', '?', '?'),

    0x0b06: ('{} -> {}', 'PP', '?', '?'),
    0x0b25: ('{}', 'P', '?', '?'),
    0x0b41: ('{} : {}', 'IP', '?', '?'),
    # точно > 8
    0x0b5e: ('{:5} : {:5} : {:5} : {:5} : {:5} : {:5} : {:5} : {:5}', 'I8', '?', '?'),
    0x0bb5: ('{} : {}', 'II', '?', '?'),
    0x0bd0: ('{} : {} : {}', 'PPP', '?', '?'),
    0x0bd1: ('{} : {}', 'PP', '?', '?'),
    0x0bd5: ('{:4} : {:4} : {:4} : {:4}', 'I4', '?', '?'),
    0x0bd7: ('{}', 'I', '?', '?'),
    0x0bd8: ('{}', 'I', '?', '?'),

    0x0c7a: ('{:3} : {:18} : {:3}', 'IPI', '?', '?'),
    0x0c83: ('{:4} : {:4} : {:4} : {:4}', 'I4', '?', '?'),
    0x0c85: ('Временная метка (2?) {} сек', 'I', '? TIME_UTC', '? TIME', 'is_timestamp'),
    0x0c8f: ('{}', 'i', '?', '?'),
    0x0c93: ('{:4} : {:4} : {:4} : {:4} : {:4}', 'I5', '?', '?'),
    0x0c96: ('{} : {}', 'PP', '?', '?'),
    0x0c9a: ('{} : {:4} : {:4} : {:4} : {:4}', 'PI4', '?', '?'),
    # Всегда идёт такая последовательность: 0x0cf6, 0x0cf7, 0x0cf2
    #                            или такая: 0x0cf6, 0x0cf7, 0x0d1f, 0x0cef, 0x0cf1, 0x0cf2, 0x0cfc, 0x0cfc, 0x0cf6, 0x0cf7
    0x0cef: ('seq_?: ?{}', 'I', '?', '?'),
    0x0cf1: ('seq_?: ?{}', 'I', '?', '?'),
    0x0cf2: ('seq_?: status? (0x0cf2)', '', '?', '?'),
    0x0cf6: ('seq_?: ?{}', 'I', '?', '?'),
    0x0cf7: ('seq_?: {:3} : {:3} : {:3} : {:3}', 'I4', '?', '?'),
    0x0cfc: ('seq_?: status? (0x0cfc)', '', '?', '?'),

    0x0d01: ('{}', 'I', '?', '?'),
    0x0d02: ('{}', 'I', '?', '?'),
    0x0d08: ('{} : {}', 'II', '?', '?'),
    0x0d0a: ('{} : {}', 'II', '?', '?'),
    0x0d1f: ('seq_?: status? (0x0d1f)', 'I', '?', '?'),
    0x0d21: ('{:12} : {:3} : {:3} : {:3} : {:3} : {:3} : {:3}', 'PIIIIII', '?', '?'),
    0x0d26: ('___pFunc___:____cnt____:_max_:_?_:_?_:_???_', '', 'LOG_BLOCK', 'ROUTER'),
    0x0d27: ('0x{:08x} : {:9} : {:3} : {} : {} : {}', 'IIIIIP', 'LOG_BLOCK', 'ROUTER'),
    0x0d2a: ('{} : {}', 'PP', '?', '?'),
    0x0d36: ('{}', 'I', '?', '?'),
    0x0d38: ('{} : {}', 'II', '?', '?'),
    0x0d39: ('MASK:{} по {} = {}', 'IPI', 'LOG_DEBUG', 'SYSDATA'),
    0x0d3e: ('{} : {}', 'II', '?', '?'),
    0x0d47: ('{} = {}', 'PP', 'LOG_DEBUG', 'SYSDATA'),
    0x0d48: ('FLAG ?: {} = {}', 'PP', '? LOG_DEBUG', '? SYSDATA'),
    0x0d4b: ('FLEX_IN: {} = {}', 'PP', 'LOG_DEBUG', 'SYSDATA'),
    0x0d58: ('{:3}: {:3}: {:3}: {:5}: {:2}.{:02} : {}', 'IIIIIIP', 'LOG_BLOCK', 'TNPROFILER'),
    0x0d5a: ('hdr_n :  hdr1 | hdr2 | hdr3 | hdr4 | hdr5 | hdr6 | hdr7 | hdr8 | hdr9 | hdr10| hdr11', '', '? LOG_BLOCK', '?'),
    # точно 12. Не меньше, т.к. используется 4 пакета, не больше, т.к. дальше встречается мусор
    0x0d5b: ('{:5} : {:6}|{:6}|{:6}|{:6}|{:6}|{:6}|{:6}|{:6}|{:6}|{:6}|{:6}', 'I12', '? LOG_BLOCK', '?'),
    0x0d5c: ('hdr_n :  hdr1', '', '? LOG_BLOCK', '?'),
    0x0d5d: ('{:5} : {:6}', 'I2', '? LOG_BLOCK', '?'),
    0x0d5e: ('{}', 'I', '?', '?'),
    0x0d5f: ('{:5} : {:5} : {:5} : {:5}', 'I4', '?', '?'),
    0x0d61: ('_ID:Стек:Не исп.:Макс.:Загруз. ...???', '', 'LOG_BLOCK', 'TNPROFILER'),
    0x0d64: ('{} : {:3} : {:3} : {:4} : {:3} : {:3} : {}', 'PIIIIIP', '?', '?'),
    0x0d66: ('device: {} : deviceID: {:08X}', 'PB', '? LOG_BLOCK', '?'),
    0x0d73: ('fw_ver_hash: {}', 'P', '? LOG_BLOCK', 'TNPROFILER'),
    0x0d74: ('модель платы?: {}', 'P', '? LOG_BLOCK', 'TNPROFILER'),
    0x0d76: ('Сборка: {}', 'P', 'LOG_BLOCK', 'TNPROFILER'),
    0x0d77: ('Git hash прошивки {}', 'P', 'LOG_BLOCK', 'TNPROFILER'),
    0x0d78: ('{} : {}', 'II', '?', '?'),
    0x0d83: ('Max Free Sectors:    {}', 'I', '? LOG_BLOCK', 'TN_HEAP'),
    0x0d84: ('Min Free Memory:     {}', 'I', '? LOG_BLOCK', 'TN_HEAP'),
    0x0d85: ('Min Free Percent:    {}', 'I', '? LOG_BLOCK', 'TN_HEAP'),
    0x0d86: ('Min Max Free Sector: {}', 'I', '? LOG_BLOCK', 'TN_HEAP'),
    0x0d87: ('Med Max Free Sector: {}', 'I', '? LOG_BLOCK', 'TN_HEAP'),
    0x0d88: ('Malloc Errors:       {}', 'I', '? LOG_BLOCK', 'TN_HEAP'),
    0x0d89: ('-- mAddr ---|-- fAddr ---|-- t...???', '', '? LOG_BLOCK', 'TN_HEAP'),
    0x0d8a: ('0x{:08x} : 0x{:08x} : {:9} : {:9}', 'IIII', '? LOG_BLOCK', 'TN_HEAP'),
    0x0d8c: ('0x{:08x} : 0x{:08x}', 'II', '? LOG_BLOCK', '? TN_HEAP'),
    0x0d8f: ('0x{:08x} : 0x{:08x}', 'II', '? LOG_BLOCK', '? TN_HEAP'),
    0x0d96: ('{}', 'I', '?', '?'),
    0x0d97: ('{}', 'I', '?', '?'),
    0x0d98: ('{}', 'I', '?', '?'),
    0x0d9a: ('{} : {} сек', 'PI', '?', '?'),
    0x0d9b: ('{}', 'P', '?', '?'),
    0x0da2: ('{} : {}', 'PP', '?', '?'),
    0x0dab: ('date...: {} : {} : {} : {}', 'PIPI', '? LOG_BLOCK', '?'),
    0x0dac: ('{}', 'P', '?', '?'),
    0x0dae: ('TPARAM STAT: total={}: max={}', 'II', '? LOG_INFO', 'TASK_PARAM'),
    0x0db6: ('{}', 'P', '?', '?'),
    0x0dbf: ('{}', 'I', '?', '?'),
    # в конце вроде 2 I, должно влезать в 2 пакета, но бывает и 2 и 3
    0x0dc1: ('{} {} {} {}', 'IPII', '?', '?'),
    0x0dc5: ('{}', 'I', '?', '?'),
    0x0dce: ('{} {} {}', 'IPI', '?', '?'),
    # 0x0dd3 всегда идёт перед 'ШВР xx по причине 0' в туже ms
    # 0x0dd4 всегда идёт перед 'ШВР xx по причине 1' в туже ms
    0x0de3: ('Датчик движения: конец сработки', '', 'LOG_INFO', 'USER_EVENT'),
    0x0de4: ('Датчик наклона: конец сработки', '', 'LOG_INFO', 'USER_EVENT'),
    0x0de5: ('Датчик удара LOW: конец сработки', '', 'LOG_INFO', 'USER_EVENT'),
    0x0de6: ('Датчик удара HIGH: конец сработки', '', 'LOG_INFO', 'USER_EVENT'),

    0x0e85: ('{} : {}', 'II', '?', '?'),
    0x0eb6: ('status? (0x0eb6)', '', '?', '?'),
    0x0eb7: ('{:5} : {:5} : {:5} : {:5} : {:5} : {:5} : {:5} : {:5} : {:5}', 'I9', '?', '?'),
    # странная последовательность
    0x0ec3: ('{:08x}-{:08x}-{:08x}', 'BBB', '?', '?'),
    0x0ec8: ('{:5} : {:5} : {:5} : {:5} : {:5}', 'IIIII', '?', '?'),
    0x0ecb: ('status?', '', '?', '?'),
    0x0ed1: ('{}', 'I', '?', '?'),
}
db_2_30_0_analyzed_es96 = {
    # какаято последовательность (гироскоп или акселерометр?) 0x0007, 0x0029, 0x002c, 0x002d, 0x002e, 0x002f, 0x0030, 0x0031, 0x0032, 0x0033, 0x0034, 0x0024, 0x0035...
    0x0007: ('seq: {}', 'P', '?', '?'),
    0x0015: ('{:3} : {:3} : {:3} : {:3} : {:3}', 'I5', '?', '?'),
    0x0016: ('{}', 'P', '?', '?'),
    0x0017: ('{}', 'P', '?', '?'),
    0x0018: ('{} : {}', 'PP', '?', '?'),
    0x0019: ('{} : {}', 'PP', '?', '?'),
    0x001a: ('{} : {} : {} : {} : {} : {} : {} : {}', 'PPPPIIIi', '?', '?'),
    0x001b: ('{} : {} : {} : {} : {} : {} : {} : {}', 'PPPPIIIi', '?', '?'),
    0x0024: ('seq: {}', 'I', '?', '?'),
    0x0029: ('seq: status? (0x0029)', '', '?', '?'),
    0x002c: ('seq: {}', 'P', '?', '?'),
    0x002d: ('seq: {}', 'P', '?', '?'),
    0x002e: ('seq: {}', 'P', '?', '?'),
    0x002f: ('seq: {}', 'P', '?', '?'),
    0x0030: ('seq: {}', 'P', '?', '?'),
    0x0031: ('seq: {}', 'P', '?', '?'),
    0x0032: ('seq: {}', 'P', '?', '?'),
    0x0033: ('seq: {}', 'I', '?', '?'),
    0x0034: ('seq: {}', 'i', '?', '?'),
    0x0035: (
    '{:4} : {:4}, {:4}, {:4}, {:4}, {:4} : {:4}, {:4}, {:4}, {:4}, {:4} : {:4}, {:4}, {:4}, {:4}, {:4}', 'ii15', '?',
    '? gyro(2)'),
    0x0039: ('{:3} : {:4} : {:4} : {:4}', 'IIII', '?', '?'),
    0x0058: ('{:3} : {:3} : {:3} : {:3} : {:3} : {:3}', 'i6', '?', '?'),
    0x005a: ('status? (0x005a)', '', '?', '?'),
    0x005c: ('{} : {}', 'PP', '?', '?'),
    0x0082: ('status? (0x0082)', '', '?', '?'),
    # вероятно перепутано 0x00a9-0x00b1
    0x00a9: ('STAT: (?) Потери по RSSI: {}', 'I', '? LOG_INFO', '? BLE'),
    0x00aa: ('STAT: (?) Ошибки модуля BLE: {}', 'I', '? LOG_INFO', '? BLE'),
    0x00ab: ('STAT: (?) Внезапные потери связи: {}', 'I', '? LOG_INFO', '? BLE'),
    0x00ac: ('STAT: (?) Восстановления связи: {}', 'I', '? LOG_INFO', '? BLE'),
    0x00ad: ('STAT: (?) Зависания BLE-модуля: {}', 'I', '? LOG_INFO', '? BLE'),
    0x00ae: ('STAT: (?) {}', 'I', '? LOG_INFO', '? BLE'),
    0x00af: ('STAT: (?) {}', 'I', '? LOG_INFO', '? BLE'),
    0x00b0: ('STAT: (?) {}', 'I', '? LOG_INFO', '? BLE'),
    0x00b1: ('STAT: (?) {}', 'I', '? LOG_INFO', '? BLE'),
    0x00c4: ('{}', 'P', '?', '?'),
    0x00c9: ('{}', 'P', '?', '?'),
    0x00f4: ('{} : {}', 'PI', '?', '?'),
    0x00f5: ('{} : {}', 'PI', '?', '?'),
    0x00fe: ('{}', 'I', '?', '?'),
    0x00ff: ('{} : {} : {}', 'PII', '?', '?'),

    0x0101: ('{} : {} : {}', 'PII', '?', '?'),
    0x0113: ('{} : {} : {}', 'IPP', '?', '?'),
    0x01bd: ('Заряд батарейки метки {}: {}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}', 'II15', '?', '? метка'),
    0x01c4: ('{} : {} : {}', 'IPP', '?', '? метка'),
    0x01c7: ('{} : {} : {}', 'IPP', '?', '? метка'),
    # бывают x1 и x2 пакеты, но закономерности в данных не нашёл
    0x01ca: ('status? (0x01ca)', '', '?', '?'),
    0x01ce: ('{} : {}', 'PI', '?', '? метка'),

    # 'block' | 'unblock'
    0x0276: ('{}', 'P', '?', '?'),
    # 'block' | 'unblock'
    0x0277: ('{}', 'P', '?', '?'),

    0x041d: ('{} : {}', 'IP', '?', '?'),

    0x058f: ('{}', 'I', '?', '?'),
    0x05b7: ('status? (0x05b7)', '', '?', '?'),
    0x05d1: ('{:3} : {:3} : {:3} : {:3} : {:3}', 'I5', '?', '?'),
    0x05f6: ('{}', 'I', '?', '?'),
    0x05fd: ('{}', 'P', '?', '?'),
    0x05fe: ('status? (0x05fe)', '', '?', '?'),
    0x05ff: ('{} : {} : {} : {} : {} : {} : {}', 'PIIIIII', '?', '?'),

    0x0600: ('status? (0x0600)', '', '?', '?'),
    0x0601: ('{} : {} : {} : {} : {} : {}', 'PIIIiI', '?', '?'),
    0x0602: ('{}', 'P', '?', '?'),
    0x0603: ('status? (0x0603)', '', '?', '?'),
    # ntp
    0x0696: ('{} : {}', 'IP', '?', '?'),
    # ntp
    0x0697: ('{} : {}', 'IP', '?', '?'),
    # ntp
    0x069a: ('{} : {} : {}', 'IIP', '?', '?'),
    0x069d: ('{}', 'i', '?', '?'),
    0x069f: ('{}', 'i', '?', '?'),
    0x06a1: ('status? (0x06a1)', '', '?', '?'),
    0x06a5: ('status? (0x06a5)', '', '?', '?'),
    0x06a7: ('status? (0x06a7)', '', '?', '?'),
    0x06a9: ('status? (0x06a9)', '', '?', '?'),
    0x06aa: ('status? (0x06aa)', '', '?', '?'),
    0x06b2: ('{} : {}', 'II', '?', '?'),
    0x06b4: ('status? (0x06b4)', '', '?', '?'),
    0x06d2: ('{}', 'P', '?', '?'),
    # какойто очень быстрый счётчик
    0x06d8: ('counter? {}', 'I', '?', '?'),

    0x0709: ('{} : {} : {}', 'PPP', '?', '? tcp'),
    # modem
    0x0715: ('{} : {} : {}', 'IPP', '?', '? simcom'),
    # 'нет' | 'есть'
    0x074e: ('{}', 'P', '?', '?'),
    # ntp
    0x0751: ('Clock (+CCLK): {}', 'P', '?', '? simcom'),
    0x0782: ('Operator: "{}", MCC: {}, MNC: {}', 'PII', '?', '? simcom'),
    0x0783: ('{} : LAC: {:4}, CellID: {:5}, RSSI?: {:3}', 'IIIi', '?', '? simcom'),
    # modem
    0x0784: ('{}', 'P', '?', '? simcom'),

    # sms 'Balance:..r'
    0x08fe: ('USSD-ответ: {}', 'P', 'LOG_DEBUG', 'SMS_MANAGER'),

    # sms '#100#' Идёт последовательность 0x0901 и через пару сек 0x08fe, 0x0e10, 0x0d4a
    0x0901: ('USSD-запрос: {}', 'P', 'LOG_DEBUG', 'SMS_MANAGER'),
    0x098c: ('status? (0x098c)', '', '?', '?'),
    0x09f0: ('status? (0x09f0)', '', '?', '?'),

    0x0a39: ('{}', 'I', '?', '?'),
    0x0a3c: ('status? (0x0a3c)', '', '?', '?'),
    0x0a72: ('status? (0x0a72)', '', '?', '?'),
    0x0a78: ('{}', 'I', '?', '?'),

    0x0b1e: ('status? (0x0b1e)', '', '?', '?'),
    0x0b26: ('0x{:x} : {}', 'II', '?', '?'),
    0x0bcc: ('status? (0x0bcc)', '', '?', '?'),
    0x0bcf: ('status? (0x0bcf)', '', '?', '?'),

    # sms
    0x0d4a: ('status? (0x0d4a)', '', '?', '? sms'),
    0x0d6a: ('status? (0x0d6a)', '', '?', '?'),
    0x0d70: ('status? (0x0d70)', '', '?', '?'),
    # ntp
    0x0d92: ('{} : {}', 'IP', '?', '?'),
    # бывают x1 и x2 пакеты, но закономерности в данных не нашёл
    0x0da7: ('status? (0x0da7)', '', '?', '?'),
    # последовательность 0x0da8, 0x0da7
    0x0da8: ('status? (0x0da8)', '', '?', '?'),
    # Скорее всего мусор от 0x03dc
    # 0x0dd1: ('{}', 'I', '?', '?'),
    # идёт после 'ZONE: ДВЕРЬ ПАССАЖИРА = active'
    0x0dd7: ('status? чтото связано с двери active', '', '?', '?'),
    # идёт после 'ZONE: ДВЕРЬ ПАССАЖИРА = passive'
    0x0dd8: ('status? чтото связано с двери passive', '', '?', '?'),
    # идёт перед 'ZONE: БАГАЖНИК = active'
    0x0ddb: ('status? чтото связано с багажник active', '', '?', '?'),
    # идёт перед 'ZONE: БАГАЖНИК = passive'
    0x0ddc: ('status? чтото связано с багажник passive', '', '?', '?'),
    # идёт перед 'ZONE: ПЕДАЛЬ ТОРМОЗА = active'
    0x0ddd: ('status? чтото связано с педаль тормоза active', '', '?', '?'),
    # идёт перед 'ZONE: ПЕДАЛЬ ТОРМОЗА = passive'
    0x0dde: ('status? чтото связано с педаль тормоза passive', '', '?', '?'),

    0x0e00: ('status? (0x0e00)', '', '?', '?'),
    # sms
    0x0e10: ('status? (0x0e10)', '', '?', '? sms'),
    # идёт перед 'ZONE: ДВЕРЬ ВОДИТЕЛЯ = active'
    0x0e4d: ('status? чтото связано с дверь водителя active', '', '?', '?'),
    # идёт перед 'ZONE: ДВЕРЬ ВОДИТЕЛЯ = passive'
    0x0e4e: ('status? чтото связано с дверь водителя passive)', '', '?', '?'),
    # идёт перед 'ZONE: ДВЕРЬ ПАССАЖИРА = active'
    0x0e4f: ('status? чтото связано с дверь пассажира active', '', '?', '?'),
    # идёт перед 'ZONE: ДВЕРЬ ПАССАЖИРА = passive'
    0x0e50: ('status? чтото связано с дверь пассажира passive', '', '?', '?'),
}
db_2_30_0 = {**db_2_30_0_known, **db_2_30_0_analyzed_e96v2, **db_2_30_0_analyzed_es96}

########################################################################################################################

db_2_30_3_analyzed = {
    0x0005: db_2_30_0[0x0005],
    0x0006: db_2_30_0[0x0006],
    0x0007: db_2_30_0[0x0007],
    0x0024: db_2_30_0[0x0024],
    0x0029: db_2_30_0[0x0029],
    0x002c: db_2_30_0[0x002c],
    0x002d: db_2_30_0[0x002d],
    0x002e: db_2_30_0[0x002e],
    0x002f: db_2_30_0[0x002f],
    0x0030: db_2_30_0[0x0030],
    0x0031: db_2_30_0[0x0031],
    0x0032: db_2_30_0[0x0032],
    0x0033: db_2_30_0[0x0033],
    0x0034: db_2_30_0[0x0034],
    0x0035: db_2_30_0[0x0035],
    0x0037: ('status? (0x0037)', '', '?', '?'),
    0x0038: ('status? (0x0038)', '', '?', '?'),
    0x0039: db_2_30_0[0x0039],
    0x0058: db_2_30_0[0x0058],
    0x0059: ('status? (0x0059)', '', '?', '?'),
    0x005a: db_2_30_0[0x005a],
    0x005b: ('status? (0x005b)', '', '?', '?'),
    0x005c: db_2_30_0[0x005c],
    0x0065: ('status? (0x0065)', '', '?', '?'),
    0x006e: db_2_30_0[0x006e],
    0x006f: db_2_30_0[0x006f],
    0x0070: db_2_30_0[0x0070],
    0x0082: ('status? (0x0082)', '', '?', '?'),
    0x0086: db_2_30_0[0x0086],
    0x0087: db_2_30_0[0x0087],
    0x0088: db_2_30_0[0x0088],
    0x0089: db_2_30_0[0x0089],
    0x008a: db_2_30_0[0x008a],
    0x008b: db_2_30_0[0x008b],
    0x008d: db_2_30_0[0x008d],
    0x0096: ('status? (0x0096)', '', '?', '?'),
    0x0098: db_2_30_0[0x0098],
    0x00a8: db_2_30_0[0x00a8],
    0x00a9: db_2_30_0[0x00a9],
    0x00aa: db_2_30_0[0x00aa],
    0x00ab: db_2_30_0[0x00ab],
    0x00ac: db_2_30_0[0x00ac],
    0x00ad: db_2_30_0[0x00ad],
    0x00ae: db_2_30_0[0x00ae],
    0x00af: db_2_30_0[0x00af],
    0x00b0: db_2_30_0[0x00b0],
    0x00b1: db_2_30_0[0x00b1],
    0x00c4: db_2_30_0[0x00c4],
    0x00c9: db_2_30_0[0x00c9],
    0x00e7: db_2_30_0[0x00e7],
    0x00ea: db_2_30_0[0x00ea],
    0x00ed: db_2_30_0[0x00ed],

    0x0101: db_2_30_0[0x0101],
    0x0107: db_2_30_0[0x0107],
    0x0108: db_2_30_0[0x0108],
    0x0113: db_2_30_0[0x0113],
    0x0117: db_2_30_0[0x0117],
    0x0130: ('{}: {}', 'IP', '?', '?'),
    0x0132: db_2_30_0[0x0132],
    0x013c: db_2_30_0[0x013c],
    0x013e: db_2_30_0[0x013e],
    0x013f: db_2_30_0[0x013f],
    0x0140: db_2_30_0[0x0140],
    0x0141: db_2_30_0[0x0141],
    0x0164: ('{} : {}', 'IP', '?', '?'),
    0x01b7: ('{:3} : {:3} : {:3} : {:3} : {:3} : {:3}', 'I6', '?', '?'),
    0x01bd: db_2_30_0[0x01bd],
    0x01c4: db_2_30_0[0x01c4],
    0x01c7: db_2_30_0[0x01c7],
    # в 2.30.3 пока попадались только x1 пакеты
    0x01ca: db_2_30_0[0x01ca],
    0x01ce: db_2_30_0[0x01ce],
    0x01d0: ('status? (0x01d0)', '', '?', '?'),
    0x01d1: ('status? (0x01d1)', '', '?', '?'),
    0x01d4: db_2_30_0[0x01d4],
    0x01d8: ('{} : {}', 'II', '?', '?'),
    0x01ea: ('{:3} : {:3} : {:3} : {:3} : {:3} : {:3}', 'I6', '?', '?'),
    0x01f0: ('{} : dump: {}', 'IP', '?', '?'),
    0x01f9: db_2_30_0[0x01f9],
    0x01fa: db_2_30_0[0x01fa],
    0x01ff: db_2_30_0[0x01ff],

    0x0202: ('{}: {}: {}: {}', 'PIII', '?', '?'),
    0x0203: ('{}: {}: {}: {}: {}: {}: {}: {}', 'I8', '?', '?'),
    0x021e: db_2_30_0[0x021e],
    0x0231: ('status? (0x0231)', '', '?', '?'),
    0x024b: db_2_30_0[0x024b],
    0x0268: db_2_30_0[0x0268],
    0x0269: db_2_30_0[0x0269],
    0x026c: ('status? (0x026c)', '', '?', '?'),
    0x026d: ('status? (0x026d)', '', '?', '?'),
    0x026e: ('{} : {}', 'II', '?', '?'),
    0x0273: db_2_30_0[0x0273],
    0x0276: db_2_30_0[0x0276],
    0x0277: db_2_30_0[0x0277],
    0x0290: ('{}', 'i', '?', '?'),
    0x0291: ('{}', 'i', '?', '?'),
    0x02a9: db_2_30_0[0x02a9],
    0x02aa: db_2_30_0[0x02aa],
    0x02b6: db_2_30_0[0x02b6],
    0x02e3: db_2_30_0[0x02e3],
    0x02e8: ('{} : {}', 'PI', '?', '?'),
    0x02ea: ('{} ', 'P', '?', '?'),
    0x02d1: ('counter of 10 sec (?): {}', 'I', '?', '?'),
    0x02dd: ('{}', 'P', '?', '?'),
    0x02de: ('{}', 'P', '?', '?'),

    0x031d: db_2_30_0[0x031d],
    0x031e: db_2_30_0[0x031e],
    0x031f: db_2_30_0[0x031f],
    0x033e: db_2_30_0[0x033e],
    0x0350: db_2_30_0[0x0350],
    0x0353: db_2_30_0[0x0353],
    0x0359: db_2_30_0[0x0359],
    0x037a: ('{} : {}', 'IP', '?', '?'),
    0x038a: db_2_30_0[0x038a],
    0x038c: ('{:3} : {:3}', 'II', '?', '?'),
    0x03d6: db_2_30_0[0x03d6],
    # 0x03d8: ('{}', 'I', '?', '?'),
    0x03d9: db_2_30_0[0x03d9],
    0x03dc: db_2_30_0[0x03dc],
    0x03f2: db_2_30_0[0x03f2],
    0x03fd: db_2_30_0[0x03fd],
    0x03ff: db_2_30_0[0x03ff],

    # 0x0408 всегда идёт перед последовательностью 0x0409, 0x040a, 0x040b, 0x040c, как и у 2.30.0
    0x0408: db_2_30_0[0x0408],
    # последовательность 0x0409, 0x040a, 0x040b, 0x040c есть у 2.30.0
    0x0409: db_2_30_0[0x0409],
    0x040a: db_2_30_0[0x040a],
    0x040b: db_2_30_0[0x040b],
    0x040c: db_2_30_0[0x040c],
    0x0434: db_2_30_0[0x0434],
    0x0440: ('status? (0x0440)', '', '?', '?'),
    0x0445: ('status? (0x0445)', '', '?', '?'),
    0x044b: db_2_30_0[0x044b],
    # точно такой-же есть у 2.30.0 сразу после 'ENG_STATE:STOPPED:STOP_ERR:NO IGN:flags=0x00:guard=0x01:src=ID_NONE'
    0x044c: db_2_30_0[0x044c],
    0x0454: ('status? (0x0454)', '', '?', '?'),
    0x0474: ('status? (0x0474)', '', '?', '?'),
    0x0477: ('status? (0x0477)', '', '?', '?'),
    # точно такой-же есть у 2.30.0 обычно перед 0x047c
    0x0479: db_2_30_0[0x0479],
    0x047c: ('status? (0x047c)', '', '?', '?'),
    0x0483: db_2_30_0[0x0483],
    0x0496: ('{} : {}', 'PP', '?', '?'),

    0x0520: ('status? (0x0520)', '', '?', '?'),
    0x0521: db_2_30_0[0x0521],
    0x058e: ('status? (0x058e)', '', '?', '?'),
    0x058f: db_2_30_0[0x058f],
    0x05b5: ('status? (0x05b5)', '', '?', '?'),
    0x05b7: db_2_30_0[0x05b7],
    0x05ba: ('status? (0x05ba)', '', '?', '?'),
    0x05cc: ('{}', 'P', '?', '?'),
    0x05d1: db_2_30_0[0x05d1],
    0x05f6: db_2_30_0[0x05f6],
    0x05fd: db_2_30_0[0x05fd],
    0x05fe: db_2_30_0[0x05fe],
    0x05ff: db_2_30_0[0x05ff],

    0x0600: db_2_30_0[0x0600],
    0x0601: db_2_30_0[0x0601],
    0x0602: db_2_30_0[0x0602],
    0x0603: db_2_30_0[0x0603],
    0x0696: db_2_30_0[0x0696],
    0x0697: db_2_30_0[0x0697],
    0x069a: db_2_30_0[0x069a],
    0x069d: db_2_30_0[0x069d],
    0x069f: db_2_30_0[0x069f],
    0x06a1: db_2_30_0[0x06a1],
    0x06a5: db_2_30_0[0x06a5],
    0x06a7: db_2_30_0[0x06a7],
    0x06a9: db_2_30_0[0x06a9],
    0x06aa: db_2_30_0[0x06aa],
    0x06b2: db_2_30_0[0x06b2],
    0x06b4: db_2_30_0[0x06b4],
    0x06d2: db_2_30_0[0x06d2],
    0x06d8: db_2_30_0[0x06d8],

    0x0700: ('{} : {}', 'PP', '?', '?'),
    0x0709: db_2_30_0[0x0709],
    0x0715: db_2_30_0[0x0715],
    0x073c: ('{} : {} : {} : {} : {} : {} : {}', 'IPIIIIP', '?', '? simcom'),
    0x073e: ('{}', 'P', '?', '?'),
    0x074b: ('{}', 'P', '?', '?'),
    0x074e: db_2_30_0[0x074e],
    0x0751: db_2_30_0[0x0751],
    0x075a: ('{} : {} : {}', 'PIP', '?', '? simcom'),
    0x077f: ('Версия ПО модема: {}', 'P', '?', '? simcom'),
    0x0780: ('{} : {}', 'IP', '?', '? simcom'),
    0x0782: db_2_30_0[0x0782],
    0x0783: db_2_30_0[0x0783],
    0x0784: db_2_30_0[0x0784],
    0x0785: ('status? (0x0785)', '', '?', '? simcom'),
    0x0786: ('Clock (+CCLK): {}', 'P', '?', '? simcom'),
    0x0787: ('IMEI модема: {}', 'P', '?', '? simcom'),
    0x0788: ('Модем: {}', 'P', '?', '? simcom'),
    0x0789: ('{} : {}', 'IP', '?', '? simcom'),
    0x07ae: ('{} : {} : {} : {}', 'PIPP', '?', '? simcom'),
    0x07af: ('{} : {} : {}', 'PPP', '?', '? simcom'),
    0x07b8: ('{}', 'P', '?', '? simcom'),

    0x08fe: db_2_30_0[0x08fe],

    0x0901: db_2_30_0[0x0901],
    0x096a: db_2_30_0[0x096a],
    0x096e: db_2_30_0[0x096e],
    0x0970: db_2_30_0[0x0970],
    0x0979: db_2_30_0[0x0979],
    0x0986: db_2_30_0[0x0986],
    0x098c: db_2_30_0[0x098c],
    0x0998: db_2_30_0[0x0998],
    0x0999: db_2_30_0[0x0999],
    0x09a1: ('status? (0x09a1)', '', '?', '?'),
    0x09a2: db_2_30_0[0x09a2],
    0x09ae: db_2_30_0[0x09ae],
    0x09af: db_2_30_0[0x09af],
    0x09b0: db_2_30_0[0x09b0],
    0x09cb: ('status? (0x09cb)', '', '?', '?'),
    0x09cc: ('status? (0x09cc)', '', '?', '?'),
    0x09f0: db_2_30_0[0x09f0],
    0x09f2: ('status? (0x09f2)', '', '?', '?'),
    0x09f5: db_2_30_0[0x09f5],

    0x0a03: ('status? (0x0a03)', '', '?', '?'),
    0x0a39: db_2_30_0[0x0a39],
    0x0a3c: db_2_30_0[0x0a3c],
    0x0a4d: db_2_30_0[0x0a4d],
    0x0a4e: db_2_30_0[0x0a4e],
    0x0a61: ('status? (0x0a61)', '', '?', '?'),
    0x0a65: db_2_30_0[0x0a65],
    0x0a66: db_2_30_0[0x0a66],
    0x0a72: db_2_30_0[0x0a72],
    0x0a78: db_2_30_0[0x0a78],
    0x0a9f: db_2_30_0[0x0a9f],
    0x0aa0: db_2_30_0[0x0aa0],
    0x0acd: db_2_30_0[0x0acd],
    0x0ace: db_2_30_0[0x0ace],

    0x0b06: db_2_30_0[0x0b06],
    0x0b1e: db_2_30_0[0x0b1e],
    0x0b25: db_2_30_0[0x0b25],
    0x0b26: db_2_30_0[0x0b26],
    0x0b41: db_2_30_0[0x0b41],
    0x0b5e: db_2_30_0[0x0b5e],
    0x0ba9: db_2_30_0[0x0ba9],
    0x0bb5: db_2_30_0[0x0bb5],
    0x0bcc: db_2_30_0[0x0bcc],
    0x0bcf: db_2_30_0[0x0bcf],
    0x0bd0: db_2_30_0[0x0bd0],
    0x0bd1: db_2_30_0[0x0bd1],
    0x0bd5: db_2_30_0[0x0bd5],
    # 0x0bd7: db_2_30_0[0x0bd7],
    0x0bd8: db_2_30_0[0x0bd8],

    0x0c7a: db_2_30_0[0x0c7a],
    0x0c83: db_2_30_0[0x0c83],
    0x0c85: db_2_30_0[0x0c85],
    0x0c87: ('fw_ver_hash (2?): {}', 'P', '?', '?'),
    0x0c8f: db_2_30_0[0x0c8f],
    0x0c93: db_2_30_0[0x0c93],
    0x0c96: db_2_30_0[0x0c96],
    0x0c9a: db_2_30_0[0x0c9a],
    0x0ca1: db_2_30_0[0x0ca1],
    0x0ca2: db_2_30_0[0x0ca2],
    0x0cc4: ('status? (0x0cc4)', '', '?', '?'),
    0x0cec: db_2_30_0[0x0cec],
    0x0cef: db_2_30_0[0x0cef],
    0x0cf1: db_2_30_0[0x0cf1],
    0x0cf2: db_2_30_0[0x0cf2],
    0x0cf6: db_2_30_0[0x0cf6],
    0x0cf7: db_2_30_0[0x0cf7],
    0x0cfc: db_2_30_0[0x0cfc],

    0x0d01: db_2_30_0[0x0d01],
    0x0d02: db_2_30_0[0x0d02],
    0x0d08: db_2_30_0[0x0d08],
    0x0d09: db_2_30_0[0x0d09],
    0x0d0a: db_2_30_0[0x0d0a],
    0x0d1f: db_2_30_0[0x0d1f],
    0x0d21: db_2_30_0[0x0d21],
    0x0d26: db_2_30_0[0x0d26],
    0x0d27: db_2_30_0[0x0d27],
    0x0d2a: db_2_30_0[0x0d2a],
    0x0d31: db_2_30_0[0x0d31],
    0x0d34: ('status? (0x0d34)', '', '?', '?'),
    0x0d35: db_2_30_0[0x0d35],
    0x0d36: db_2_30_0[0x0d36],
    0x0d38: db_2_30_0[0x0d38],
    0x0d39: db_2_30_0[0x0d39],
    0x0d3e: db_2_30_0[0x0d3e],
    0x0d3f: db_2_30_0[0x0d3f],
    0x0d46: db_2_30_0[0x0d46],
    0x0d47: db_2_30_0[0x0d47],
    0x0d48: db_2_30_0[0x0d48],
    0x0d4a: db_2_30_0[0x0d4a],
    0x0d4b: db_2_30_0[0x0d4b],
    0x0d52: ('{} : {}', 'PI', '?', '?'),
    0x0d54: ('{} : {}', 'PP', '?', '?'),
    0x0d58: db_2_30_0[0x0d58],
    0x0d5a: db_2_30_0[0x0d5a],
    0x0d5b: db_2_30_0[0x0d5b],
    0x0d5c: db_2_30_0[0x0d5c],
    0x0d5d: db_2_30_0[0x0d5d],
    0x0d5e: db_2_30_0[0x0d5e],
    0x0d5f: db_2_30_0[0x0d5f],
    0x0d61: db_2_30_0[0x0d61],
    # 0x0d64: db_2_30_0[0x0d64],
    0x0d66: db_2_30_0[0x0d66],
    0x0d6a: db_2_30_0[0x0d6a],
    0x0d70: db_2_30_0[0x0d70],
    0x0d73: db_2_30_0[0x0d73],
    0x0d74: db_2_30_0[0x0d74],
    0x0d76: db_2_30_0[0x0d76],
    0x0d77: db_2_30_0[0x0d77],
    0x0d78: db_2_30_0[0x0d78],
    0x0d83: db_2_30_0[0x0d83],
    0x0d84: db_2_30_0[0x0d84],
    0x0d85: db_2_30_0[0x0d85],
    0x0d86: db_2_30_0[0x0d86],
    0x0d87: db_2_30_0[0x0d87],
    0x0d88: db_2_30_0[0x0d88],
    0x0d89: db_2_30_0[0x0d89],
    0x0d8a: db_2_30_0[0x0d8a],
    0x0d8c: db_2_30_0[0x0d8c],
    0x0d8f: db_2_30_0[0x0d8f],
    0x0d92: db_2_30_0[0x0d92],
    0x0d96: db_2_30_0[0x0d96],
    0x0d97: db_2_30_0[0x0d97],
    0x0d98: db_2_30_0[0x0d98],
    0x0d9a: db_2_30_0[0x0d9a],
    0x0d9b: db_2_30_0[0x0d9b],
    0x0da2: db_2_30_0[0x0da2],
    0x0da7: db_2_30_0[0x0da7],
    0x0da8: db_2_30_0[0x0da8],
    0x0dab: db_2_30_0[0x0dab],
    0x0dac: db_2_30_0[0x0dac],
    0x0dae: db_2_30_0[0x0dae],
    0x0db6: db_2_30_0[0x0db6],
    # ПЛЮС 1 (от 2.30.0)
    0x0dc2: db_2_30_0[0x0dc2-1],
    0x0dc6: db_2_30_0[0x0dc6-1],
    0x0dcf: db_2_30_0[0x0dcf-1],
    0x0dd0: db_2_30_0[0x0dd0-1],
    0x0dd1: db_2_30_0[0x0dd1-1],
    0x0dd3: db_2_30_0[0x0dd3-1],
    # 0x0dd4: всегда идёт перед 'ШВР xx по причине 0' в туже ms
    # 0x0dd5: всегда идёт перед 'ШВР xx по причине 1' в туже ms
    0x0dd6: ('status? (0x0dd6)', '', '?', '?'),
    0x0dd7: ('status? (0x0dd7)', '', '?', '?'),
    0x0dd8: db_2_30_0[0x0dd8-1],
    0x0dd9: db_2_30_0[0x0dd9-1],
    0x0ddc: db_2_30_0[0x0ddc-1],
    0x0ddd: db_2_30_0[0x0ddd-1],
    0x0dde: db_2_30_0[0x0dde-1],
    0x0ddf: db_2_30_0[0x0ddf-1],
    0x0de4: db_2_30_0[0x0de4-1],
    0x0de5: db_2_30_0[0x0de5-1],
    0x0de6: db_2_30_0[0x0de6-1],
    0x0de7: db_2_30_0[0x0de7-1],

    0x0e01: ('status? (0x0e01)', '', '?', '?'),
    # 0x0e02 всегда перед 'ШВР 20 по причине 54' в туже ms
    0x0e02: db_2_30_0[0x0e02-1],
    # sms
    0x0e11: ('status? (0x0e11)', '', '?', '? sms'),
    0x0e16: ('status? (0x0e16)', '', '?', '?'),

    0x0e4e: db_2_30_0[0x0e4e-1],
    0x0e4f: db_2_30_0[0x0e4f-1],
    0x0e50: db_2_30_0[0x0e50-1],
    0x0e51: db_2_30_0[0x0e51-1],
    0x0e86: db_2_30_0[0x0e86-1],
    0x0eb7: ('status? (0x0eb7)', '', '?', '?'),
    0x0eb8: db_2_30_0[0x0eb8-1],
    0x0ec4: db_2_30_0[0x0ec4-1],
    0x0ec9: db_2_30_0[0x0ec9-1],
    0x0ecc: ('status? (0x0ecc)', '', '?', '?'),

    0xfe00: ('previous fw_ver_hash: {}', 'P', '?', '?'),
    0xfe01: db_2_30_0[0xfe01],
}
db_2_30_3 = {**db_2_30_3_analyzed}

########################################################################################################################

db = {
    # ver 2.20.0
    '904053a26b495aef13d7e1cd8e28d1d1': {**db_2_20_0, **db_2_20_0_analyzed},

    # ver 2.24.2
    '703f0148c3705b1b550f6022c6833900': {**db_2_24_2},

    # ver 2.26.1
    '2eed061cce3fd5309e8304daf24df156': {**db_2_26_1},

    # ver 2.28.2
    'af45310c1f61734aa3e487cdcf43e6ac': {**db_2_28_2, **db_2_28_2_analyzed},

    # ver 2.30.0
    '2c4897a3a3b2b4b58cc6367e30de60c4': db_2_30_0,

    # ver 2.30.3
    'b6768c2e7299c827ec78711b759b81b5': db_2_30_3,
}
